src/Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/AccumulationRegisters/РабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Comment>Контрагент плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыРаспределенияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыРаспределенияРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВыручке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасамПриемаВрачей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуПринятыхПациентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСебестоимостиЗатраченныхМатериалов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗакрытиеМесяца/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерВременнойТаблицы,
	|	КОНЕЦПЕРИОДА(ЗакрытиеМесяца.МесяцРаспределения, МЕСЯЦ) КАК Период,
	|	ЗакрытиеМесяца.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Прибыль) КАК СчетКт,
	|	ОборотДоходыВыручка.Специализация КАК СубконтоДт1,
	|	ОборотДоходыВыручка.Номенклатура КАК СубконтоДт2,
	|	ОборотДоходыВыручка.Сотрудник КАК СубконтоДт3,
	|	ОборотДоходыВыручка.Контрагент КАК СубконтоДт4,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка) КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка) КАК СубконтоКт2,
	|	NULL КАК СубконтоКт3,
	|	NULL КАК СубконтоКт4,
	|	ОборотДоходыВыручка.СуммаОборотКт КАК Сумма,
	|	""Закрытие месяца"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УправленческийОбороты.Счет КАК Счет,
	|			УправленческийОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			УправленческийОбороты.Субконто1 КАК Специализация,
	|			УправленческийОбороты.Субконто2 КАК Номенклатура,
	|			УправленческийОбороты.Субконто3 КАК Сотрудник,
	|			УправленческийОбороты.Субконто4 КАК Контрагент,
	|			СУММА(УправленческийОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыВыручка), , СтруктурнаяЕдиница = &СтруктурнаяЕдиница, , ) КАК УправленческийОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УправленческийОбороты.Счет,
	|			УправленческийОбороты.Субконто1,
	|			УправленческийОбороты.СтруктурнаяЕдиница,
	|			УправленческийОбороты.Субконто2,
	|			УправленческийОбороты.Субконто3,
	|			УправленческийОбороты.Субконто4) КАК ОборотДоходыВыручка
	|		ПО ЗакрытиеМесяца.СтруктурнаяЕдиница = ОборотДоходыВыручка.СтруктурнаяЕдиница
	|ГДЕ
	|	ЗакрытиеМесяца.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	КОНЕЦПЕРИОДА(ЗакрытиеМесяца.МесяцРаспределения, МЕСЯЦ),
	|	ЗакрытиеМесяца.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Прибыль),
	|	ОборотДоходыПрочие.Субконто1,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	ОборотДоходыПрочие.СуммаОборотКт,
	|	""Закрытие месяца""
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УправленческийОбороты.Счет КАК Счет,
	|			УправленческийОбороты.Субконто1 КАК Субконто1,
	|			УправленческийОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			СУММА(УправленческийОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие), , СтруктурнаяЕдиница = &СтруктурнаяЕдиница, , ) КАК УправленческийОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УправленческийОбороты.Счет,
	|			УправленческийОбороты.Субконто1,
	|			УправленческийОбороты.СтруктурнаяЕдиница) КАК ОборотДоходыПрочие
	|		ПО ЗакрытиеМесяца.СтруктурнаяЕдиница = ОборотДоходыПрочие.СтруктурнаяЕдиница
	|ГДЕ
	|	ЗакрытиеМесяца.Ссылка = &Ссылка
	|	И ОборотДоходыПрочие.СуммаОборотКт > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	КОНЕЦПЕРИОДА(ЗакрытиеМесяца.МесяцРаспределения, МЕСЯЦ),
	|	ЗакрытиеМесяца.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Прибыль),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость),
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка),
	|	NULL,
	|	ОборотыПоРасходамСеб.Специализация,
	|	ОборотыПоРасходамСеб.Контрагент,
	|	ОборотыПоРасходамСеб.Сотрудник,
	|	ОборотыПоРасходамСеб.СтатьяРасходов,
	|	ОборотыПоРасходамСеб.СуммаОборотДт,
	|	""Закрытие месяца""
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УправленческийОбороты.Счет КАК Счет,
	|			УправленческийОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			УправленческийОбороты.Субконто1 КАК Специализация,
	|			УправленческийОбороты.Субконто2 КАК Контрагент,
	|			УправленческийОбороты.Субконто3 КАК Сотрудник,
	|			УправленческийОбороты.Субконто4 КАК СтатьяРасходов,
	|			СУММА(УправленческийОбороты.СуммаОборотДт) КАК СуммаОборотДт
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Обороты(&НачалоПериода, &КонецПериода, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость), , СтруктурнаяЕдиница = &СтруктурнаяЕдиница, , ) КАК УправленческийОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УправленческийОбороты.Счет,
	|			УправленческийОбороты.Субконто1,
	|			УправленческийОбороты.СтруктурнаяЕдиница,
	|			УправленческийОбороты.Субконто2,
	|			УправленческийОбороты.Субконто3,
	|			УправленческийОбороты.Субконто4) КАК ОборотыПоРасходамСеб
	|		ПО ЗакрытиеМесяца.СтруктурнаяЕдиница = ОборотыПоРасходамСеб.СтруктурнаяЕдиница
	|ГДЕ
	|	ЗакрытиеМесяца.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	КОНЕЦПЕРИОДА(ЗакрытиеМесяца.МесяцРаспределения, МЕСЯЦ),
	|	ЗакрытиеМесяца.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Прибыль),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыРаспределенные),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ОборотыРасходыРаспределенные.Специализация,
	|	ОборотыРасходыРаспределенные.Сотрудник,
	|	ОборотыРасходыРаспределенные.СтатьяРасходов,
	|	NULL,
	|	ОборотыРасходыРаспределенные.СуммаОборотДт,
	|	""Закрытие месяца""
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УправленческийОбороты.Счет КАК Счет,
	|			УправленческийОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			УправленческийОбороты.Субконто1 КАК Специализация,
	|			УправленческийОбороты.Субконто2 КАК Сотрудник,
	|			УправленческийОбороты.Субконто3 КАК СтатьяРасходов,
	|			СУММА(УправленческийОбороты.СуммаОборотДт) КАК СуммаОборотДт
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					,
	|					Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыРаспределенные),
	|					,
	|					СтруктурнаяЕдиница = &СтруктурнаяЕдиница,
	|					КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса)
	|						ИЛИ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк),
	|					) КАК УправленческийОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УправленческийОбороты.Счет,
	|			УправленческийОбороты.Субконто1,
	|			УправленческийОбороты.СтруктурнаяЕдиница,
	|			УправленческийОбороты.Субконто2,
	|			УправленческийОбороты.Субконто3) КАК ОборотыРасходыРаспределенные
	|		ПО ЗакрытиеМесяца.СтруктурнаяЕдиница = ОборотыРасходыРаспределенные.СтруктурнаяЕдиница
	|ГДЕ
	|	ЗакрытиеМесяца.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка"             , ДокументСсылка);
	Запрос.УстановитьПараметр("НачалоПериода"      , НачалоМесяца(ДокументСсылка.МесяцРаспределения));
    Запрос.УстановитьПараметр("КонецПериода"       , КонецМесяца(ДокументСсылка.МесяцРаспределения));
    Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ДокументСсылка.СтруктурнаяЕдиница);
	
	Запрос.ВыполнитьПакет();
		
	СформироватьТаблицаУправленческий(ДокументСсылка,СтруктураДополнительныеСвойства);

КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылка,СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВременнаяТаблицаУправленческий.НомерВременнойТаблицы,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт3,
	|	ВременнаяТаблицаУправленческий.СубконтоКт4,
	|	ВременнаяТаблицаУправленческий.Сумма КАК Сумма,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|ГДЕ
	|	ВременнаяТаблицаУправленческий.Сумма <> 0";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	// Замена колонкис меньшей точностью после запятой
	КолонкаСумма     = РезультатЗапроса.Колонки.Найти("Сумма");
	ВыгрузкаКолонки  = РезультатЗапроса.ВыгрузитьКолонку(КолонкаСумма);
	РезультатЗапроса.Колонки.Удалить(КолонкаСумма);
	РезультатЗапроса.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	РезультатЗапроса.ЗагрузитьКолонку(ВыгрузкаКолонки,"Сумма");
		
	// Подготовка таблицы показателя процентов пропорционально распределения в разрезе сотрудников. По выручке.
	ТаблицаДоходыВыручка = РегистрыБухгалтерии.Управленческий.ПолучитьОборотПоСчетуВразрезеСубконто(НачалоМесяца(ДокументСсылка.МесяцРаспределения),КонецМесяца(ДокументСсылка.МесяцРаспределения),ДокументСсылка.СтруктурнаяЕдиница,ПланыСчетов.Управленческий.ДоходыВыручка,,,,,,,Истина,,ДокументСсылка);
	ТаблицаДоходыВыручка.Колонки.Добавить("Процент",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	ДоходыВыручкаСумма = ТаблицаДоходыВыручка.Итог("СуммаОборотКт");
	// Получение процентного соотношения сумм к Субконто1
	Если ДоходыВыручкаСумма > 0 Тогда
		Для Каждого СтрокаТ ИЗ ТаблицаДоходыВыручка Цикл
			СтрокаТ.Процент = (СтрокаТ.СуммаОборотКт * 100) / ДоходыВыручкаСумма;
		КонецЦикла;
	КонецЕсли;
	// Подготовка таблицы показателя процентов пропорционально распределения в разрезе сотрудников. По отработаному времени 
	ТаблицаОтработанногоВремени = РегистрыНакопления.РабочееВремяСотрудников.ПолучитьОтработанноеВремяСотрудников(ДокументСсылка.СтруктурнаяЕдиница, НачалоМесяца(ДокументСсылка.МесяцРаспределения),КонецМесяца(ДокументСсылка.МесяцРаспределения));
	ТаблицаОтработанногоВремени.Колонки.Добавить("Процент",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	СуммарновеВремя = ТаблицаОтработанногоВремени.Итог("Время");
	// Получение процентного соотношения сумм к Субконто1
	Если СуммарновеВремя > 0 Тогда
		Для Каждого СтрокаТ ИЗ ТаблицаОтработанногоВремени Цикл
			СтрокаТ.Процент = (СтрокаТ.Время * 100) / СуммарновеВремя;
		КонецЦикла;
	КонецЕсли;
	// Подготовка таблицы показателя процентов пропорционально распределения в разрезе сотрудников. По количеству приемов. 
	ТаблицаколичестваПриемов = РегистрыНакопления.Продажи.ПолучитьКоличествоПриемовПроведеныхСотрудниками(ДокументСсылка.СтруктурнаяЕдиница, НачалоМесяца(ДокументСсылка.МесяцРаспределения),КонецМесяца(ДокументСсылка.МесяцРаспределения));
	ТаблицаколичестваПриемов.Колонки.Добавить("Процент",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	СуммарновеКолПриемов = ТаблицаколичестваПриемов.Итог("КоличествоПриемов");
	// Получение процентного соотношения сумм к Субконто1
	Если СуммарновеКолПриемов > 0 Тогда
		Для Каждого СтрокаТ ИЗ ТаблицаколичестваПриемов Цикл
			СтрокаТ.Процент = (СтрокаТ.КоличествоПриемов * 100) / СуммарновеКолПриемов;
		КонецЦикла;
	КонецЕсли;
	// Подготовка таблицы показателя процентов пропорционально распределения в разрезе сотрудников. По себестоимости затраченых материалов
	ТаблицаРасходыСебестоимость = РегистрыБухгалтерии.Управленческий.ПолучитьОборотПоСчетуВразрезеСубконто(НачалоМесяца(ДокументСсылка.МесяцРаспределения),КонецМесяца(ДокументСсылка.МесяцРаспределения),ДокументСсылка.СтруктурнаяЕдиница,ПланыСчетов.Управленческий.РасходыСебестоимость,,,,Справочники.СтатьиДоходовИРасходов.Материалы,,,Истина,,ДокументСсылка);
	ТаблицаРасходыСебестоимость.Колонки.Добавить("Процент",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	РасходыСебестоимостьСумма = ТаблицаРасходыСебестоимость.Итог("СуммаОборотДт");
	// Получение процентного соотношения сумм к Субконто1
	Если РасходыСебестоимостьСумма > 0 Тогда
		Для Каждого СтрокаТ ИЗ ТаблицаРасходыСебестоимость Цикл
			СтрокаТ.Процент = (СтрокаТ.СуммаОборотДт * 100) / РасходыСебестоимостьСумма;
		КонецЦикла;
	КонецЕсли;
	  	
	// Получаем таблицу сумм распределения 
	ТаблицаРасходыПрочие = РегистрыБухгалтерии.Управленческий.ПолучитьОборотПоСчетуВразрезеСубконто(НачалоМесяца(ДокументСсылка.МесяцРаспределения),КонецМесяца(ДокументСсылка.МесяцРаспределения),ДокументСсылка.СтруктурнаяЕдиница,ПланыСчетов.Управленческий.РасходыПрочие,,,,, Истина,Истина,,,ДокументСсылка);	
	ТаблицаРасходыПрочиеБезСтатьи = Новый Массив;
	/// Распределение прочих расходово РАСХОДЫ ПРЧ. -> РАСХОДЫ.РАСП
	Для Каждого СтрокаТСуммы ИЗ ТаблицаРасходыПрочие Цикл
		Если СтрокаТСуммы.СуммаОборотДт <> 0 Тогда
			Если ЗначениеЗаполнено(СтрокаТСуммы.Субконто1) Тогда
				СуммаСтрок = 0;
				// Если распределение ведется по выручке
				Если СтрокаТСуммы.Субконто1.ВидРаспределенияРасходов = Перечисления.ВидыРаспределенияРасходов.ПоВыручке Тогда			
					Для Каждого СтрокаТПроценты ИЗ ТаблицаДоходыВыручка Цикл
						НоваяСтрока                       = РезультатЗапроса.Добавить();
						НоваяСтрока.НомерВременнойТаблицы = 3;
						НоваяСтрока.Период                = КонецМесяца(ДокументСсылка.МесяцРаспределения);
						НоваяСтрока.СтруктурнаяЕдиница    = ДокументСсылка.СтруктурнаяЕдиница;
						НоваяСтрока.СчетДт                = ПланыСчетов.Управленческий.РасходыРаспределенные;
						НоваяСтрока.СчетКт                = ПланыСчетов.Управленческий.РасходыПрочие;
						НоваяСтрока.СубконтоДт1           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.СубконтоДт2           = СтрокаТПроценты.Субконто3;
						НоваяСтрока.СубконтоДт3           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт1           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт2           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.Сумма                 = (СтрокаТСуммы.СуммаОборотДт * СтрокаТПроценты.Процент) / 100; 
						НоваяСтрока.Содержание            = "Закрытие месяца";
						СуммаСтрок                        = СуммаСтрок + НоваяСтрока.Сумма;
					КонецЦикла;	
					// Если распределение ведется по отработанному времени	
				ИначеЕсли СтрокаТСуммы.Субконто1.ВидРаспределенияРасходов = Перечисления.ВидыРаспределенияРасходов.ПоЧасамПриемаВрачей Тогда
					Для Каждого СтрокаТПроценты ИЗ ТаблицаОтработанногоВремени Цикл
						НоваяСтрока                       = РезультатЗапроса.Добавить();
						НоваяСтрока.НомерВременнойТаблицы = 3;
						НоваяСтрока.Период                = КонецМесяца(ДокументСсылка.МесяцРаспределения);
						НоваяСтрока.СтруктурнаяЕдиница    = ДокументСсылка.СтруктурнаяЕдиница;
						НоваяСтрока.СчетДт                = ПланыСчетов.Управленческий.РасходыРаспределенные;
						НоваяСтрока.СчетКт                = ПланыСчетов.Управленческий.РасходыПрочие;
						НоваяСтрока.СубконтоДт1           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.СубконтоДт2           = СтрокаТПроценты.Сотрудник;
						НоваяСтрока.СубконтоДт3           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт1           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт2           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.Сумма                 = (СтрокаТСуммы.СуммаОборотДт * СтрокаТПроценты.Процент) / 100; 
						НоваяСтрока.Содержание            = "Закрытие месяца";
						СуммаСтрок                        = СуммаСтрок + НоваяСтрока.Сумма;
					КонецЦикла;	
					
					// Если распределение ведется по количеству принятых пациентов	
				ИначеЕсли СтрокаТСуммы.Субконто1.ВидРаспределенияРасходов = Перечисления.ВидыРаспределенияРасходов.ПоКоличествуПринятыхПациентов Тогда	
					Для Каждого СтрокаТПроценты ИЗ ТаблицаколичестваПриемов Цикл
						НоваяСтрока                       = РезультатЗапроса.Добавить();
						НоваяСтрока.НомерВременнойТаблицы = 3;
						НоваяСтрока.Период                = КонецМесяца(ДокументСсылка.МесяцРаспределения);
						НоваяСтрока.СтруктурнаяЕдиница    = ДокументСсылка.СтруктурнаяЕдиница;
						НоваяСтрока.СчетДт                = ПланыСчетов.Управленческий.РасходыРаспределенные;
						НоваяСтрока.СчетКт                = ПланыСчетов.Управленческий.РасходыПрочие;
						НоваяСтрока.СубконтоДт1           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.СубконтоДт2           = СтрокаТПроценты.Сотрудник;
						НоваяСтрока.СубконтоДт3           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт1           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт2           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.Сумма                 = (СтрокаТСуммы.СуммаОборотДт * СтрокаТПроценты.Процент) / 100; 
						НоваяСтрока.Содержание            = "Закрытие месяца";
						СуммаСтрок                        = СуммаСтрок + НоваяСтрока.Сумма;
					КонецЦикла;	
					
					// Если распределение ведется по себестоимости затраченых материалов	
				ИначеЕсли СтрокаТСуммы.Субконто1.ВидРаспределенияРасходов = Перечисления.ВидыРаспределенияРасходов.ПоСебестоимостиЗатраченныхМатериалов Тогда	
					Для Каждого СтрокаТПроценты ИЗ ТаблицаРасходыСебестоимость Цикл
						НоваяСтрока                       = РезультатЗапроса.Добавить();
						НоваяСтрока.НомерВременнойТаблицы = 3;
						НоваяСтрока.Период                = КонецМесяца(ДокументСсылка.МесяцРаспределения);
						НоваяСтрока.СтруктурнаяЕдиница    = ДокументСсылка.СтруктурнаяЕдиница;
						НоваяСтрока.СчетДт                = ПланыСчетов.Управленческий.РасходыРаспределенные;
						НоваяСтрока.СчетКт                = ПланыСчетов.Управленческий.РасходыПрочие;
						НоваяСтрока.СубконтоДт1           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.СубконтоДт2           = СтрокаТПроценты.Субконто3;
						НоваяСтрока.СубконтоДт3           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт1           = СтрокаТСуммы.Субконто1;
						НоваяСтрока.СубконтоКт2           = СтрокаТСуммы.Субконто2;
						НоваяСтрока.Сумма                 = (СтрокаТСуммы.СуммаОборотДт * СтрокаТПроценты.Процент) / 100; 
						НоваяСтрока.Содержание            = "Закрытие месяца";
						СуммаСтрок                        = СуммаСтрок + НоваяСтрока.Сумма;
					КонецЦикла;	
					
					// Если статья не указана
				Иначе
					ТаблицаРасходыПрочиеБезСтатьи.Добавить(СтрокаТСуммы);
				КонецЕсли;
				
				// Корректировка суммы последней строки, сглаживание неточности
				Если СуммаСтрок > 0 Тогда
					РазницаСумм = СуммаСтрок - СтрокаТСуммы.СуммаОборотДт;
					Если РазницаСумм > 0 Тогда
						РезультатЗапроса[РезультатЗапроса.Количество() - 1].Сумма = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Сумма - РазницаСумм;
					ИначеЕсли РазницаСумм < 0 Тогда	
						РезультатЗапроса[РезультатЗапроса.Количество() - 1].Сумма = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Сумма + -РазницаСумм;
					КонецЕсли;	
				КонецЕсли;
			Иначе
				ТаблицаРасходыПрочиеБезСтатьи.Добавить(СтрокаТСуммы);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Распределение расходов распределенных  РАСХОДЫ.РАСП -> ПРИБЫЛЬ	
	ТаблицаРасходыПрочие = РезультатЗапроса.НайтиСтроки(Новый Структура("СчетДт,СчетКт",ПланыСчетов.Управленческий.РасходыРаспределенные,ПланыСчетов.Управленческий.РасходыПрочие));
	Для Каждого СтрокаТ ИЗ ТаблицаРасходыПрочие Цикл
		НоваяСтрока                       = РезультатЗапроса.Добавить();
		НоваяСтрока.НомерВременнойТаблицы = 4;
		НоваяСтрока.Период                = КонецМесяца(ДокументСсылка.МесяцРаспределения);
		НоваяСтрока.СтруктурнаяЕдиница    = ДокументСсылка.СтруктурнаяЕдиница;
		НоваяСтрока.СчетДт                = ПланыСчетов.Управленческий.Прибыль;
		НоваяСтрока.СчетКт                = ПланыСчетов.Управленческий.РасходыРаспределенные;
		НоваяСтрока.СубконтоКт1           = СтрокаТ.СубконтоДт1;
		НоваяСтрока.СубконтоКт2           = СтрокаТ.СубконтоДт2;
		НоваяСтрока.СубконтоКт3           = СтрокаТ.СубконтоДт3;
		НоваяСтрока.Сумма                 = СтрокаТ.Сумма; 
		НоваяСтрока.Содержание            = "Закрытие месяца";
	КонецЦикла;	
   ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Распределение расходов прочих без указания статьи  РАСХОДЫ.ПРЧ -> ПРИБЫЛЬ	
	Для Каждого СтрокаТ ИЗ ТаблицаРасходыПрочиеБезСтатьи Цикл
		НоваяСтрока                       = РезультатЗапроса.Добавить();
		НоваяСтрока.НомерВременнойТаблицы = 5;
		НоваяСтрока.Период                = КонецМесяца(ДокументСсылка.МесяцРаспределения);
		НоваяСтрока.СтруктурнаяЕдиница    = ДокументСсылка.СтруктурнаяЕдиница;
		НоваяСтрока.СчетДт                = ПланыСчетов.Управленческий.Прибыль;
		НоваяСтрока.СчетКт                = ПланыСчетов.Управленческий.РасходыПрочие;
		НоваяСтрока.СубконтоКт1           = СтрокаТ.Субконто1;
		НоваяСтрока.СубконтоКт2           = СтрокаТ.Субконто2;
		НоваяСтрока.Сумма                 = СтрокаТ.СуммаОборотДт; 
		НоваяСтрока.Содержание            = "Закрытие месяца";
	КонецЦикла;
	
	РезультатЗапроса.Сортировать("НомерВременнойТаблицы Возр");	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса);	
	
КонецПроцедуры

// Процедура создает закрытия месяца
// 
Процедура ОбновлениеЗакрытияМесяца(ДатаЗакрытия) Экспорт
	
	МассивДанныхУчета = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	
	Для Каждого ДанныеУчета Из МассивДанныхУчета Цикл
		
		Запрос =  Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.Дата КАК Дата
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.ПометкаУдаления = ЛОЖЬ
		|	И ЗакрытиеМесяца.Дата = &Период
		|	И ЗакрытиеМесяца.СтруктурнаяЕдиница = &ДанныеУчета"); 
		
		Запрос.УстановитьПараметр("ДанныеУчета"   , ДанныеУчета);
		Запрос.УстановитьПараметр("Период"        , ДатаЗакрытия);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			// Если уже есть зарытие месяца то ничего не делаем 			
		Иначе
			// Создаём и проводи закрытие месяца 
			ЗакрытиеМесяцаОбъект = Документы.ЗакрытиеМесяца.СоздатьДокумент();
			ЗакрытиеМесяцаОбъект.СтруктурнаяЕдиница = ДанныеУчета;
			ЗакрытиеМесяцаОбъект.МесяцРаспределения = ДатаЗакрытия;
			ЗакрытиеМесяцаОбъект.Дата               = ДатаЗакрытия;
			ЗакрытиеМесяцаОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
		КонецЕсли;		
		
	КонецЦикла; 
	
КонецПроцедуры


#КонецОбласти
